config.org
#+title: Bonk's emacs config
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Basic UI config
** General conf
#+begin_src emacs-lisp

	(setq inhibit-startup-message t)
  (setq warning-minimum-level :emergency)

	(scroll-bar-mode -1) ; Disable visible scrollbar
	(tool-bar-mode -1)   ; Disable the toolbar
	(tooltip-mode -1)    ; Disable tooltips
	(set-fringe-mode 10) ; Give some breathing room

	(menu-bar-mode -1)   ; isable the menu bar

	;; Set up the visible bell
	(setq visible-bell t)

  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
				  term-mode-hook
				  shell-mode-hook
				  eshell-mode-hook))
	(add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Font Configuration

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font  "Sarasa Gothic CL-12")
  (set-face-font 'variable-pitch "Iosevka-12")
  (set-face-font 'fixed-pitch "Sarasa Gothic CL-12")

  ;;============================================================
  ;; toggle between variable pitch and fixed pitch font for 
  ;; the current buffer
  (defun fixed-pitch-mode ()
	(buffer-face-mode -1))

  (defun variable-pitch-mode ()
	(buffer-face-mode t))

  (defun toggle-pitch (&optional arg)
	"Switch between the `fixed-pitch' face and the `variable-pitch' face"
	(interactive)
	(buffer-face-toggle 'variable-pitch))

  ;; enable buffer-face mode to provide buffer-local fonts
  (buffer-face-mode)

  ;; Set the fonts to format correctly
  (add-hook 'text-mode-hook 'fixed-pitch-mode)
  (add-hook 'dired-mode-hook 'variable-pitch-mode)
  (add-hook 'calendar-mode-hook 'variable-pitch-mode)
  (add-hook 'org-agenda-mode-hook 'variable-pitch-mode)
  (add-hook 'shell-mode-hook 'variable-pitch-mode)
  (add-hook 'eshell-mode-hook 'variable-pitch-mode)
  (add-hook 'neotree-mode-hook 'variable-pitch-mode)
  (add-hook 'counsel-mode-hook 'variable-pitch-mode)
  (add-hook 'command-log-mode-hook 'variable-pitch-mode)
  (add-hook 'which-key-mode-hook 'variable-pitch-mode)
  (add-hook 'ivy-mode-hook 'variable-pitch-mode)
  (add-hook 'helpful-mode-hook 'variable-pitch-mode)
										  ;(Add-hook 'bs-mode-hook 'fixed-pitch-mode)
										  ;(add-hook 'w3m-mode-hook 'variable-pitch-mode)
										  ;(add-hook 'org-mode-hook 'variable-pitch-mode)
  (add-hook 'eww-mode-hook 'variable-pitch-mode)

  ;; (C-q Tab) inserts a tab space
  (add-hook 'ess-mode-hook (lambda () (local-set-key "\t" 'self-insert-command)))


#+end_src

* Package And System setup

#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))


  (setq package-check-signature nil) 
  ;; probably not necessary


  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (use-package exec-path-from-shell)
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
  (use-package use-package-ensure-system-package)

#+end_src

#+RESULTS:

* Keybinding Configuration

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.
[[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.
[[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings
for evil-mode.

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
	:config
	(general-create-definer bonk/leader-keys
	  :keymaps '(normal insert visual emacs)
	  :prefix "SPC"
	  :global-prefix "C-SPC"))

	(bonk/leader-keys
	  "t"  '(:ignore t :which-key "toggles")
	  "tt" '(counsel-load-theme :which-key "choose theme")
	;; Window navigation
	  "H" '(windmove-left :which-key "move to left window")
	  "L" '(windmove-right :which-key "move to right window")
	  "J" '(windmove-down :which-key "move to below window")
	  "K" '(windmove-up :which-key "move to above window")
	;; Buffer options
	  "DD" '(kill-this-buffer :which "kills the current buffer")
	  "vcc" '(vterm-send-C-c :which "kills current vterm process")
	  "nn" '(neotree-toggle :which "toggles neotree")
	  )

  (use-package evil
	:init
	(setq evil-want-integration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	:config
	(evil-mode 1)
	(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
	(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
	:after evil
	:config
	(evil-collection-init))

#+end_src

* UI Configuration

** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp

	  (use-package command-log-mode
		:commands command-log-mode)

#+end_src

#+RESULTS:

** Color Theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp

  (use-package doom-themes
  :init (load-theme 'doom-zenburn t))
  (use-package ewal-spacemacs-themes)
  (use-package moe-theme)
  (use-package zenburn-theme)
  (use-package yoshi-theme)
  (use-package sublime-themes)
  (use-package gruvbox-theme)
  (use-package color-theme-sanityinc-tomorrow)
  (use-package cyberpunk-theme)

#+end_src

#+RESULTS:

