config.md


<a id="org9086ba1"></a>

## Better Modeline

[doom-modeline](https://github.com/seagle0128/doom-modeline) is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [configuration options](https://github.com/seagle0128/doom-modeline#customize) for more things you can enable or disable.

**NOTE:** The first time you load your configuration on a new machine, you'll need to run \`M-x all-the-icons-install-fonts\` so that mode line icons display correctly.

    
    (use-package all-the-icons)
    
    (use-package doom-modeline
      :init (doom-modeline-mode 1)
      :custom ((doom-modeline-height 15)))


<a id="orge2907ef"></a>

## Which Key

[which-key](https://github.com/justbur/emacs-which-key) is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press `C-c` (hold control and press the letter `c`), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

    
    (use-package which-key
      :defer 0
      :diminish which-key-mode
      :config
      (which-key-mode)
      (set-face-attribute 'which-key-local-map-description-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-key-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-separator-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-note-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-special-key-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-group-description-face nil :font "Iosevka-12")
      (set-face-attribute 'which-key-command-description-face nil :font "Iosevka-12")
      (setq which-key-idle-delay 1)
      (setq which-key-allow-imprecise-window-fit t))


<a id="org8ba4a30"></a>

## Ivy and Counsel

[Ivy](https://oremacs.com/swiper/) is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.  Counsel is a customized set of commands to replace \`find-file\` with \`counsel-find-file\`, etc which provide useful commands for each of the default completion commands.

[ivy-rich](https://github.com/Yevgnen/ivy-rich) adds extra columns to a few of the Counsel commands to provide more information about each item.

    
    (use-package ivy
      :diminish
      :bind (("C-s" . swiper)
    		 :map ivy-minibuffer-map
    		 ("TAB" . ivy-alt-done)
    		 ("C-l" . ivy-alt-done)
    		 ("C-j" . ivy-next-line)
    		 ("C-k" . ivy-previous-line)
    		 :map ivy-switch-buffer-map
    		 ("C-k" . ivy-previous-line)
    		 ("C-l" . ivy-done)
    		 ("C-d" . ivy-switch-buffer-kill)
    		 :map ivy-reverse-i-search-map
    		 ("C-k" . ivy-previous-line)
    		 ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1))
    
    (use-package ivy-rich
      :init
      (ivy-rich-mode 1))
    
    (use-package counsel
      :bind (("C-M-j" . 'counsel-switch-buffer)
    		 :map minibuffer-local-map
    		 ("C-r" . 'counsel-minibuffer-history))
      :config
      (counsel-mode 1))


<a id="org39572cf"></a>

## Helpful Help Commands

[Helpful](https://github.com/Wilfred/helpful) adds a lot of very helpful (get it?) information to Emacs' `describe-` command buffers.  For example, if you use `describe-function`, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

    
    (use-package helpful
      :commands (helpful-callable helpful-variable helpful-command helpful-key)
      :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
      :bind
      ([remap describe-function] . counsel-describe-function)
      ([remap describe-command] . helpful-command)
      ([remap describe-variable] . counsel-describe-variable)
      ([remap describe-key] . helpful-key))


<a id="org2b0b3cf"></a>

## Text Scaling

This is an example of using [Hydra](https://github.com/abo-abo/hydra) to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to `C-s t s` and, once activated, `j` and `k` increase and decrease the text scale.  You can press any other key (or `f` specifically) to exit the transient key map.

    
    (use-package hydra
      :defer t)
    
    (defhydra hydra-text-scale (:timeout 4)
      "scale text"
      ("j" text-scale-increase "in")
      ("k" text-scale-decrease "out")
      ("f" nil "finished" :exit t))
    
    (bonk/leader-keys
      "ts" '(hydra-text-scale/body :which-key "scale text"))


<a id="org92acb9b"></a>

## Rule mode

    	;; Use ruler in text-mode
    ;;    (add-hook 'text-mode-hook
       ;;       (function (lambda ()
    	   ;;	   (setq ruler-mode-show-tab-stops t)
    		   ;;   (ruler-mode 1))))


<a id="org8385a92"></a>

## Ido (tool for buffer)

    (use-package ido
      :config
      (ido-mode 'buffers) ;; only use this line to turn off ido for file names!
      (setq ido-ignore-buffers '("^ " "*Completions*" "*Shell Command Output*"
    							 "*Messages*" "Async Shell Command")))


<a id="orgc274d4c"></a>

# Org Mode


<a id="org1bfc463"></a>

## Basic configuration

    
    (defun bonk/org-no-line-number ()
      (global-display-line-numbers-mode 0))
    
      (use-package org
    	:pin org
    	:commands (org-capture org-agenda)
    	:hook
    	(org-mode . bonk/org-mode-setup)
    	 (org-mode . bonk/org-no-line-number)
    	:config
    	(setq org-ellipsis " ▾")
    	(bonk/org-font-setup))


<a id="org3cf6926"></a>

## Better Font Faces

    
    (defun bonk/org-font-setup ()
      ;; Replace list hyphen with dot
      (font-lock-add-keywords 'org-mode
    			  '(("^ *\\([-]\\) "
    			 (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
    
      ;; Set faces for heading levels
      (dolist (face '((org-level-1 . 1.2)
    		  (org-level-2 . 1.1)
    		  (org-level-3 . 1.05)
    		  (org-level-4 . 1.0)
    		  (org-level-5 . 1.1)
    		  (org-level-6 . 1.1)
    		  (org-level-7 . 1.1)
    		  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Sarasa Fixed Slab K"
    			:weight 'regular
    			:height (cdr face)))
    
      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))


<a id="orgdcbf0bf"></a>

## Nicer Heading Bullets

    (use-package org-bullets
      :after org
      :hook (org-mode . org-bullets-mode)
      :custom
      (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))


<a id="orgffc73ac"></a>

## Center Org Buffers

    (defun bonk/org-mode-visual-fill ()
      (setq visual-fill-column-width 100
    		visual-fill-column-center-text t)
      (visual-fill-column-mode 1))
    
    (use-package visual-fill-column
      :after org
      :hook (org-mode . bonk/org-mode-visual-fill))
