config.org
** Auto-tangle Configuration FIles

#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun bonk/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/github/emacs-config/config.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle)))
    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bonk/org-babel-tangle-config))))

#+end_src

** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
	  (with-eval-after-load 'org
		(org-babel-do-load-languages
		  'org-babel-load-languages
		  '((emacs-lisp . t)
			(python . t)
			(typescript . t)
			(go . t)
			(rust . t)))

		(push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

* Development
** General configs

   Here is the config for wether using tabs, how to indent, how many spaces, etc.

   #+begin_src emacs-lisp

	 (setq-default indent-tabs-mode t)
	 (setq-default tab-width 4) ; I want tabs to be four spaces wide
	 ;; Indentation levels for each lang
	 (defvaralias 'js2-basic-offset 'tabwidth)
	 (defvaralias 'js-indent-level 'tab-width)
	 (defvaralias 'js-indent-level 'tab-width)
	 (defvaralias 'rjsx-indent-level 'tab-width)
	 (defvaralias 'rjsx-mode-markup-indent-offset 'tab-width)
	 (defvaralias 'rjsx-mode-code-indent-offset 'tab-width)
	 (defvaralias 'web-mode-css-indent-offset 'tab-width)
	 (defvaralias 'js2-indent-level 'tab-width)

	 ;; Increase for better lsp-mode performance; see
	 ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
	 (setq gc-cons-threshold 100000000)
	 (when (boundp 'read-process-output-max)
	   ;; New in Emacs 27
	   (setq read-process-output-max (* 2048 2048)))
   #+end_src
** Languages

*** IDE Features with lsp-mode

**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp


	(defun bonk/lsp-mode-setup ()
	  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
	  (lsp-headerline-breadcrumb-mode))

	(use-package lsp-mode
	  :ensure t
	  :commands (lsp lsp-deferred)
	  :hook (lsp-mode . bonk/lsp-mode-setup)
	  :init
	  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
	  :config

	  (add-hook 'typescript-mode-hook 'lsp)
	  (add-hook 'rjsx-mode-hook 'lsp)
	  (add-hook 'php-mode 'lsp)
	  (add-hook 'css-mode 'lsp)
	  (add-hook 'web-mode 'lsp)
	  (lsp-enable-which-key-integration t)
	  (setq lsp-completion-enable t)

	  (setq lsp-language-id-configuration '((java-mode . "java")
						(python-mode . "python")
						(gfm-view-mode . "markdown")
						(rust-mode . "rust")
						(css-mode . "css")
						(xml-mode . "xml")
						(c-mode . "c")
						(c++-mode . "cpp")
						(objc-mode . "objective-c")
						(web-mode . "html")
						(html-mode . "html")
						(sgml-mode . "html")
						(mhtml-mode . "html")
						(go-mode . "go")
						(haskell-mode . "haskell")
						(php-mode . "php")
						(json-mode . "json")
						(rjsx-mode . "javascript")
						(typescript-mode . "typescript")
						))

	  (setq lsp-diagnostics-provider :none)

	  :custom
	  (lsp-file-watch-threshold nil)
	  (lsp-solargraph-multi-root nil))

#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more
like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning
of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+end_src

**** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp

	(use-package lsp-ivy
	  :after lsp)

#+end_src

**** lsp-clients
     #+begin_src emacs-lisp
     #+end_src
*** Yasnippets
    Yasnippet automatically inserts code templates when I write a word and press the tab key.
    It predefines most of the common templates, including the dreadful =if err !\=nil { ....=

    #+begin_src emacs-lisp

	  (use-package yasnippet                  ; Snippets
		:after company
		:config
		(setq
		 yas-verbosity 1                      ; No need to be so verbose
		 yas-wrap-around-region t)

		(with-eval-after-load 'yasnippet
		  (setq yas-snippt-dirs '(yasnippet-snippets-dir)))

		(yas-reload-all)
		(yas-global-mode))

	  (use-package yasnippet-snippets         ; Collection of snippets
		:after yasnippet)
    #+end_src

*** Flycheck

    Flycheck is one of the two main packages for code checks in the background. The
    other one is Flymake. I use Flycheck because it allows me to define a custom “advanced”
    checker.
    #+begin_src emacs-lisp

			(use-package flycheck
			  :after company)
			(setq flycheck-disabled-checkers '(ruby ruby-reek ruby-rubocop ruby-rubylint yaml-ruby))

    #+end_src
