config.md


<a id="orgb9e1c01"></a>

## Auto-tangle Configuration FIles

    ;; Automatically tangle our Emacs.org config file when we save it
    (defun bonk/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
    					  (expand-file-name "~/github/emacs-config/config.org"))
    	;; Dynamic scoping to the rescue
    	(let ((org-confirm-babel-evaluate nil))
    	  (org-babel-tangle)))
      (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bonk/org-babel-tangle-config))))


<a id="orgf0b37ea"></a>

## Configure Babel Languages

To execute or export code in `org-mode` code blocks, you'll need to set up `org-babel-load-languages` for each language you'd like to use.  [This page](https://orgmode.org/worg/org-contrib/babel/languages.html) documents all of the languages that you can use with `org-babel`.

    (with-eval-after-load 'org
      (org-babel-do-load-languages
    	'org-babel-load-languages
    	'((emacs-lisp . t)
    	  (python . t)
    	  (typescript . t)
    	  (go . t)
    	  (rust . t)))
    
      (push '("conf-unix" . conf-unix) org-src-lang-modes))


<a id="orgbd5f00b"></a>

# Development


<a id="orged74f72"></a>

## General configs

Here is the config for wether using tabs, how to indent, how many spaces, etc.

    
    (setq-default indent-tabs-mode t)
    (setq-default tab-width 4) ; I want tabs to be four spaces wide
    ;; Indentation levels for each lang
    (defvaralias 'js2-basic-offset 'tabwidth)
    (defvaralias 'js-indent-level 'tab-width)
    (defvaralias 'js-indent-level 'tab-width)
    (defvaralias 'rjsx-indent-level 'tab-width)
    (defvaralias 'rjsx-mode-markup-indent-offset 'tab-width)
    (defvaralias 'rjsx-mode-code-indent-offset 'tab-width)
    (defvaralias 'web-mode-css-indent-offset 'tab-width)
    (defvaralias 'js2-indent-level 'tab-width)
    
    ;; Increase for better lsp-mode performance; see
    ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
    (setq gc-cons-threshold 100000000)
    (when (boundp 'read-process-output-max)
      ;; New in Emacs 27
      (setq read-process-output-max (* 2048 2048)))


<a id="orgced23aa"></a>

## Languages


<a id="org925d318"></a>

### IDE Features with lsp-mode

1.  lsp-mode

    We use the excellent [lsp-mode](https://emacs-lsp.github.io/lsp-mode/) to enable IDE-like functionality for many different programming languages via "language servers" that speak the [Language Server Protocol](https://microsoft.github.io/language-server-protocol/).  Before trying to set up `lsp-mode` for a particular language, check out the [documentation for your language](https://emacs-lsp.github.io/lsp-mode/page/languages/) so that you can learn which language servers are available and how to install them.
    
    The `lsp-keymap-prefix` setting enables you to define a prefix for where `lsp-mode`'s default keybindings will be added.  I **highly recommend** using the prefix to find out what you can do with `lsp-mode` in a buffer.
    
    The `which-key` integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing `C-c l` in a `lsp-mode` buffer and trying different things that you find there.
    
        
        
        (defun bonk/lsp-mode-setup ()
          (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
          (lsp-headerline-breadcrumb-mode))
        
        (use-package lsp-mode
          :ensure t
          :commands (lsp lsp-deferred)
          :hook (lsp-mode . bonk/lsp-mode-setup)
          :init
          (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
          :config
        
          (add-hook 'typescript-mode-hook 'lsp)
          (add-hook 'rjsx-mode-hook 'lsp)
          (add-hook 'php-mode 'lsp)
          (add-hook 'css-mode 'lsp)
          (add-hook 'web-mode 'lsp)
          (lsp-enable-which-key-integration t)
          (setq lsp-completion-enable t)
        
          (setq lsp-language-id-configuration '((java-mode . "java")
        					(python-mode . "python")
        					(gfm-view-mode . "markdown")
        					(rust-mode . "rust")
        					(css-mode . "css")
        					(xml-mode . "xml")
        					(c-mode . "c")
        					(c++-mode . "cpp")
        					(objc-mode . "objective-c")
        					(web-mode . "html")
        					(html-mode . "html")
        					(sgml-mode . "html")
        					(mhtml-mode . "html")
        					(go-mode . "go")
        					(haskell-mode . "haskell")
        					(php-mode . "php")
        					(json-mode . "json")
        					(rjsx-mode . "javascript")
        					(typescript-mode . "typescript")
        					))
        
          (setq lsp-diagnostics-provider :none)
        
          :custom
          (lsp-file-watch-threshold nil)
          (lsp-solargraph-multi-root nil))

2.  lsp-ui

    [lsp-ui](https://emacs-lsp.github.io/lsp-ui/) is a set of UI enhancements built on top of `lsp-mode` which make Emacs feel even more
    like an IDE.  Check out the screenshots on the `lsp-ui` homepage (linked at the beginning
    of this paragraph) to see examples of what it can do.
    
        
        (use-package lsp-ui
          :hook (lsp-mode . lsp-ui-mode)
          :custom
          (lsp-ui-doc-position 'bottom))

3.  lsp-treemacs

    [lsp-treemacs](https://github.com/emacs-lsp/lsp-treemacs) provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.
    
    Try these commands with `M-x`:
    
    -   `lsp-treemacs-symbols` - Show a tree view of the symbols in the current file
    -   `lsp-treemacs-references` - Show a tree view for the references of the symbol under the cursor
    -   `lsp-treemacs-error-list` - Show a tree view for the diagnostic messages in the project
    
    This package is built on the [treemacs](https://github.com/Alexander-Miller/treemacs) package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.
    
        
        (use-package lsp-treemacs
          :after lsp)

4.  lsp-ivy

    [lsp-ivy](https://github.com/emacs-lsp/lsp-ivy) integrates Ivy with `lsp-mode` to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.
    
    Try these commands with `M-x`:
    
    -   `lsp-ivy-workspace-symbol` - Search for a symbol name in the current project workspace
    -   `lsp-ivy-global-workspace-symbol` - Search for a symbol name in all active project workspaces
    
        
        (use-package lsp-ivy
          :after lsp)

5.  lsp-clients


<a id="org7130121"></a>

### Yasnippets

Yasnippet automatically inserts code templates when I write a word and press the tab key.
It predefines most of the common templates, including the dreadful `if err !\=nil { ....`

    
    (use-package yasnippet                  ; Snippets
      :after company
      :config
      (setq
       yas-verbosity 1                      ; No need to be so verbose
       yas-wrap-around-region t)
    
      (with-eval-after-load 'yasnippet
    	(setq yas-snippt-dirs '(yasnippet-snippets-dir)))
    
      (yas-reload-all)
      (yas-global-mode))
    
    (use-package yasnippet-snippets         ; Collection of snippets
      :after yasnippet)


<a id="org44a3b3a"></a>

### Flycheck

Flycheck is one of the two main packages for code checks in the background. The
other one is Flymake. I use Flycheck because it allows me to define a custom “advanced”
checker.

    
    (use-package flycheck
      :after company)
    (setq flycheck-disabled-checkers '(ruby ruby-reek ruby-rubocop ruby-rubylint yaml-ruby))
