config.md


<a id="org4d503e9"></a>

### TypeScript

This is a basic configuration for the TypeScript language so that `.ts` files activate `typescript-mode` when opened.  We're also adding a hook to `typescript-mode-hook` to call `lsp-deferred` so that we activate `lsp-mode` to get LSP features every time we edit TypeScript code.

    
    (use-package typescript-mode
      :mode "\\.ts\\'"
      :hook (typescript-mode . lsp-deferred))

**Important note!**  For `lsp-mode` to work with TypeScript (and JavaScript) you will need to install a language server on your machine.  If you have Node.js installed, the easiest way to do that is by running the following command:

    
    npm install -g typescript-language-server typescript

This will install the [typescript-language-server](https://github.com/theia-ide/typescript-language-server) and the TypeScript compiler package.


<a id="org3dee510"></a>

### Ruby

1.  inf-ruby

        (use-package inf-ruby
          :after lsp)

2.  ruby-mode

        (use-package ruby-mode
          :mode "\\.rb\\'"
          :hook ((ruby-mode . lsp-deferred))
          :config
          (setq ruby-indent-tabs-mode t)
          (setq ruby-indent-level tab-width))
        
        (use-package enh-ruby-mode
          :after ruby-mode
          :config
          (setq enh-ruby-indent-tabs-mode t))

3.  robe-mode

        (use-package robe
          :after ruby-mode)
        (add-hook 'ruby-mode-hook 'robe-mode)
        (eval-after-load 'company
          '(push 'company-robe company-backends))

4.  Flymake

        (require 'flymake-ruby)
        (add-hook 'ruby-mode-hook 'flymake-ruby-load)

5.  rspec-mode

        (use-package rspec-mode
          :after ruby-mode)
        (eval-after-load 'rspec-mode
          '(rspec-install-snippets))


<a id="orge0d0fde"></a>

### Golang

    (use-package go-mode
      :mode "\\.go\\'"
      :hook (go-mode . lsp-deferred)
      :config
      (add-hook 'go-mode-hook (lambda ()
    							(setq tab-width 4)))
      (add-hook 'go-mode-hook #'lsp)
      (add-hook 'before-save-hook 'gofmt-before-save)
      (defun lsp-go-install-save-hooks ()
    	(add-hook 'before-save-hook 'lsp-format-buffer t t)
    	(add-hook 'before-save-hook 'lsp-organize-imports t t))
      (add-hook 'go-mode-hook 'lsp-go-install-save-hooks)
      ;; configure gopls
      (lsp-register-custom-settings
       '(("gopls.completeUnimported" t t)
    	 ("gopls.staticcheck" t t)))
      ;; Start LSP Mode and YASnippet mode
      (add-hook 'go-mode-hook 'lsp-deferred)
      (add-hook 'go-mode-hook 'yas-minor-mode))


<a id="org931c602"></a>

### Elisp


<a id="orgda45c7f"></a>

### Rust


<a id="org62c8699"></a>

### C/C++


<a id="orgb5386f6"></a>

### Javascript

1.  Web Mode

        
        (use-package web-mode
          :mode "\\.html$'" "\\.jsx$" "\\.tsx$"
          :init 
          (setq web-mode-markup-indent-offset 4)
          (setq web-mode-css-indent-offset 4)
          (setq web-mode-code-indent-offset 4)
          )

2.  RJSX mode

    It has all the features from js2 , and all the js files i've been using till now are .js
    files, so i don't really need to differentiate between modes
    
        (use-package rjsx-mode
          :mode "\\.js\\'"
          :hook (rjsx-mode . lsp-deferred)
          :init
          (setq indent-tabs-mode t)
          (setq js2-basic-offset 4))

3.  Tide

        (defun setup-tide-mode()
          "Setup function for tide."
          (interactive)
          (tide-setup)
          (flycheck-mode +1)
          (setq flycheck-check-syntax-automatically '(save mode-enabled)))
        
          (use-package tide
        	:after (rjsx-mode company flycheck)
        	:hook (rjsx-mode . setup-tide-mode))

4.  Prettier

    It is important to have prettier installed through npm beforehand though
    `npm install -g prettier`
    
        (use-package prettier-js
          :after (rjsx-mode)
          :hook (rjsx-mode . setup-tide-mode))


<a id="org90093c8"></a>

### Yaml

    ;; yaml-mode doesn't derive from prog-mode, but we can at least enable
    ;; whitespace-mode and apply cleanup.
    (use-package yaml-mode
      :after lsp-mode
      :config
      (add-hook 'yaml-mode-hook 'whitespace-mode)
      (add-hook 'yaml-mode-hook 'subword-mode))


<a id="org3bb13f5"></a>

## Company Mode

[Company Mode](http://company-mode.github.io/) provides a nicer in-buffer completion interface than `completion-at-point` which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (`TAB` now completes the selection and initiates completion at the current location if needed).

We also use [company-box](https://github.com/sebastiencs/company-box) to further enhance the look of the completions with icons and better overall presentation.

    
    (use-package company
      :after lsp-mode
      :hook (lsp-mode . company-mode)
      :bind (:map company-active-map
    	  ("<tab>" . company-complete-selection))
      (:map lsp-mode-map
    	("<tab>" . company-indent-or-complete-common))
      :custom
      (company-minimum-prefix-length 1)
      (company-idle-delay 0.2))
    
    (global-company-mode t)
    (use-package company-box
      :hook (company-mode . company-box-mode))
    (eval-after-load 'company
      '(push 'company-robe company-backends))


<a id="orgbb4454f"></a>

### Company Backends

1.  Golang

2.  Ruby

          (use-package company-inf-ruby
        :after (company ruby-mode)
        :config (add-to-list 'company-backends 'company-inf-ruby))

3.  JavaScript

        
          (use-package ac-js2
        :after (company tide js2-mode web-mode)
        :config (add-to-list 'company-backends 'ac-js2))

4.  Web

        
        	;; HTML company backend
        	   (use-package company-web
        	 :after (company web-mode)
        	 :config (add-to-list 'company-backends 'company-web))
        ;; WIP missing CSS backend

5.  eLisp

        ;; Add `company-elisp' backend for elisp.
        (add-hook 'emacs-lisp-mode-hook
        		  '(lambda ()
        			 (require 'company-elisp)
        			 (push 'company-elisp company-backends)))


<a id="org61de8c9"></a>

## Projectile

[Projectile](https://projectile.mx/) is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

    
    (use-package projectile
      :diminish projectile-mode
      :config (projectile-mode)
      :custom ((projectile-completion-system 'ivy))
      :bind-keymap
      ("C-c p" . projectile-command-map)
      :init
      ;; NOTE: Set this to the folder where you keep your Git repos!
      (when (file-directory-p "~/github")
    	(setq projectile-project-search-path '("~/github")))
      (setq projectile-switch-project-action #'projectile-dired))
    
    (use-package counsel-projectile
      :config (counsel-projectile-mode))


<a id="orgc6e0c15"></a>

## Magit

[Magit](https://magit.vc/) is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

    
    (use-package magit
      :custom
      (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
    
    ;; NOTE: Make sure to configure a GitHub token before using this package!
    ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
    ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
    ;; (use-package forge)
