config.org
*** KeyBindings

 - =n= next line, =p= previous line。
 - =SPC= or =RET= or =TAB= Open current item if it is a file. Fold/Unfold current item if it is a directory.
 - =U= Go up a directory
 - =g= Refresh
 - =A= Maximize/Minimize the NeoTree Window
 - =H= Toggle display hidden files
 - =O= Recursively open a directory
 - =C-c C-n= Create a file or create a directory if filename ends with a ‘/’
 - =C-c C-d= Delete a file or a directory.
 - =C-c C-r= Rename a file or a directory.
 - =C-c C-c= Change the root directory.
 - =C-c C-p= Copy a file or a directory.


*** Configuration

#+begin_src emacs-lisp

  (use-package neotree
	:config
	(setq neo-theme (if (display-graphic-p) 'icons 'arrow)))


#+end_src

* Structure Templates
#+begin_src emacs-lisp
  (with-eval-after-load 'org
	  (require 'org-tempo)
	(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
	(add-to-list 'org-structure-template-alist '("py" . "src python"))
	(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
	(add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
	(add-to-list 'org-structure-template-alist '("js" . "src javascript")))

#+end_src

#+RESULTS:
: ((el . src emacs-lisp) (py . src python) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))
* Applications
** example config 'Some App'
#+begin_src conf-unix :tangle ~/.config/some-app/config :mkdirp yes

	value=4

#+end_src

