config.md


<a id="org832d657"></a>

## NeoTree


<a id="org8438c2b"></a>

### KeyBindings

-   `n` next line, `p` previous line。
-   `SPC` or `RET` or `TAB` Open current item if it is a file. Fold/Unfold current item if it is a directory.
-   `U` Go up a directory
-   `g` Refresh
-   `A` Maximize/Minimize the NeoTree Window
-   `H` Toggle display hidden files
-   `O` Recursively open a directory
-   `C-c C-n` Create a file or create a directory if filename ends with a ‘/’
-   `C-c C-d` Delete a file or a directory.
-   `C-c C-r` Rename a file or a directory.
-   `C-c C-c` Change the root directory.
-   `C-c C-p` Copy a file or a directory.


<a id="org395ed0a"></a>

### Configuration

    
    (use-package neotree
      :config
      (setq neo-theme (if (display-graphic-p) 'icons 'arrow)))


<a id="org2bdd679"></a>

# Structure Templates

    (with-eval-after-load 'org
    	(require 'org-tempo)
      (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
      (add-to-list 'org-structure-template-alist '("js" . "src javascript")))


<a id="org41c0d36"></a>

# Applications


<a id="orgd1c70a9"></a>

## example config 'Some App'

    
    value=4

